In [20]:
# importando librerias
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [2]:
# traer la info

df = pd.read_excel("autos.xlsx")
df.head(3)

    Marca   Modelo    Año  Precio  Kilometraje       Fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019
2     BMW       X5  2.021   50000        10000  10-11-2021

In [3]:
df1 = pd.read_excel("autos.xlsx", sheet_name="primera_parte")
df2 = pd.read_excel("autos.xlsx", sheet_name="segunda_parte")
df3 = pd.read_excel("autos.xlsx", sheet_name="tercera_parte")

In [4]:
df1

    Marca   Modelo    Año  Precio  Kilometraje       Fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019
2     BMW       X5  2.021   50000        10000  10-11-2021
3    Audi       A4  2.018   35000        25000  25-12-2018

In [5]:
df2

        Marca   Modelo    Año  Precio  Kilometraje       Fecha
0       Honda    Civic  2.017   18000        18000  05-03-2017
1   Chevrolet   Camaro  2.020   35000        15000  12-07-2020
2    Mercedes  C-Class  2.019   40000        25000  22-09-2019
3  Volkswagen     Golf  2.018   22000        30000  11-11-2018

In [6]:
df3

     Marca   Modelo    Año  Precio  Kilometraje       Fecha
0   Nissan   Sentra  2.021   21000        12000  09-01-2021
1  Hyundai  Elantra  2.018   17000        22000  15-05-2018
2      Kia  Sorento  2.020   28000        18000  18-06-2020
3    Mazda     CX-5  2.019   26000        20000  30-08-2019

In [14]:
# CONCAT ---- UNIRME ESOS DF DE MANERA UNA SOBRE OTRA O UNA AL LADO DE OTRA (TENIENDO EN CUENTA EL EJE -axis=0/1)

concatenado = pd.concat([df1,df2,df3],axis=0, ignore_index=True)

In [15]:
concatenado

         Marca   Modelo    Año  Precio  Kilometraje       Fecha
0       Toyota  Corolla  2.020   20000        15000  15-05-2020
1         Ford  Mustang  2.019   30000        20000  20-08-2019
2          BMW       X5  2.021   50000        10000  10-11-2021
3         Audi       A4  2.018   35000        25000  25-12-2018
4        Honda    Civic  2.017   18000        18000  05-03-2017
5    Chevrolet   Camaro  2.020   35000        15000  12-07-2020
6     Mercedes  C-Class  2.019   40000        25000  22-09-2019
7   Volkswagen     Golf  2.018   22000        30000  11-11-2018
8       Nissan   Sentra  2.021   21000        12000  09-01-2021
9      Hyundai  Elantra  2.018   17000        22000  15-05-2018
10         Kia  Sorento  2.020   28000        18000  18-06-2020
11       Mazda     CX-5  2.019   26000        20000  30-08-2019

In [16]:
# COPIA DEL CONCATENADO
concatenado1 = concatenado.copy()

In [18]:
concatenado1.head(2)

    Marca   Modelo    Año  Precio  Kilometraje       Fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019

In [19]:
# MERGE
datos = pd.read_csv("datos.csv")
datos.head(3)

   _id  costo   moneda
0    5   alto    euros
1    6  medio  dolares
2    7   bajo    euros

In [28]:
concatenado1 = concatenado1.assign(ID=np.arange(0,12))

In [30]:
concatenado1.head(2)

    Marca   Modelo    Año  Precio  Kilometraje       Fecha  ID
0  Toyota  Corolla  2.020   20000        15000  15-05-2020   0
1    Ford  Mustang  2.019   30000        20000  20-08-2019   1

In [31]:
datos.head(2)

   _id  costo   moneda
0    5   alto    euros
1    6  medio  dolares

In [32]:
# MERGE TIPO INNER
mergeado = datos.merge(concatenado1, left_on="_id" , right_on="ID")

In [34]:
mergeado.head(2)

,_id,costo,moneda,Marca,Modelo,Año,Precio,Kilometraje,Fecha,ID
0,5,alto,euros,Chevrolet,Camaro,2.020,35000,15000,12-07-2020,5
1,6,medio,dolares,Mercedes,C-Class,2.019,40000,25000,22-09-2019,6

In [40]:
mergeado1 = pd.merge(left=concatenado1, right=datos, how="right",left_on="ID" , right_on="_id")

In [38]:
mergeado1.head()

,_id,costo,moneda,Marca,Modelo,Año,Precio,Kilometraje,Fecha,ID
0,NaN,NaN,NaN,Toyota,Corolla,2.020,20000,15000,15-05-2020,0
1,NaN,NaN,NaN,Ford,Mustang,2.019,30000,20000,20-08-2019,1
2,NaN,NaN,NaN,BMW,X5,2.021,50000,10000,10-11-2021,2
3,NaN,NaN,NaN,Audi,A4,2.018,35000,25000,25-12-2018,3
4,NaN,NaN,NaN,Honda,Civic,2.017,18000,18000,05-03-2017,4

In [41]:
fr1 = pd.read_csv("frame1.csv")
fr2 = pd.read_csv("frame2.csv")

In [51]:
fr1.head()

   ID     Name  Age         City  Score
0   1    Alice   25     New York     85
1   2      Bob   30  Los Angeles     88
2   3  Charlie   35      Chicago     90
3   4    David   40      Houston     92
4   5      Eve   45      Phoenix     95

In [52]:
fr2.head()

   ID     Name Department  Salary   Join_Date
0   3  Charlie         HR   70000  2015-08-01
1   4    David    Finance   80000  2016-09-15
2   5      Eve         IT   90000  2017-10-20
3   6    Frank  Marketing   85000  2018-11-30
4   7    Grace      Sales   75000  2019-12-25

In [48]:
# MERGE DE DOS COLUMNAS!!!

merge_2_columnas = pd.merge(left=fr1,right= fr2, on=["ID","Name"], how="inner" )

In [49]:
merge_2_columnas

   ID     Name  Age     City  Score Department  Salary   Join_Date
0   3  Charlie   35  Chicago     90         HR   70000  2015-08-01
1   4    David   40  Houston     92    Finance   80000  2016-09-15
2   5      Eve   45  Phoenix     95         IT   90000  2017-10-20

In [53]:
concatenado1.head(3)

    Marca   Modelo    Año  Precio  Kilometraje       Fecha  ID
0  Toyota  Corolla  2.020   20000        15000  15-05-2020   0
1    Ford  Mustang  2.019   30000        20000  20-08-2019   1
2     BMW       X5  2.021   50000        10000  10-11-2021   2

In [54]:
concatenado1.rename(columns = {"Marca":"marca","Modelo":"modelo"}, inplace=True)

In [56]:
concatenado1 = concatenado.copy()

In [57]:
concatenado1.head(3)

    Marca   Modelo    Año  Precio  Kilometraje       Fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019
2     BMW       X5  2.021   50000        10000  10-11-2021

In [58]:
concatenado1.columns = concatenado1.columns.str.lower()

In [62]:
concatenado1.head(3)

    marca   modelo    año  precio  kilometraje       fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019
2     BMW       X5  2.021   50000        10000  10-11-2021

In [66]:
concatenado1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   marca        12 non-null     object
 1   modelo       12 non-null     object
 2   año          12 non-null     object
 3   precio       12 non-null     int64
 4   kilometraje  12 non-null     int64
 5   fecha        12 non-null     object
dtypes: int64(2), object(4)
memory usage: 704.0+ bytes

In [65]:
# CAMBIO DE TIPO DE ELEMENTO

concatenado1["año"] = concatenado1["año"].astype("str")

In [67]:
concatenado1["año"] = concatenado1["año"].str.replace(".","")

C:\Users\Ignacio\AppData\Local\Temp\ipykernel_15192\4245047753.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  concatenado1["año"] = concatenado1["año"].str.replace(".","")

In [69]:
concatenado1.head(2)

    marca   modelo   año  precio  kilometraje       fecha
0  Toyota  Corolla   202   20000        15000  15-05-2020
1    Ford  Mustang  2019   30000        20000  20-08-2019

In [73]:
concatenado1["año"] = concatenado1["año"].replace("Married","married")     .str.lower()     str.upper()

In [74]:
concatenado1.head(2)

    marca   modelo   año  precio  kilometraje       fecha
0  Toyota  Corolla  2020   20000        15000  15-05-2020
1    Ford  Mustang  2019   30000        20000  20-08-2019

In [75]:
concatenado1["año"].unique()

array(['2020', '2019', '2021', '2018', '2017'], dtype=object)

In [76]:
concatenado1["año"] = concatenado1["año"].astype("int64")

In [77]:
concatenado1["año"].unique()

array([2020, 2019, 2021, 2018, 2017], dtype=int64)

In [78]:
# quiero los autos de un valor mayor a 20000

mayor_20 = concatenado1["precio"] > 20000

In [79]:
autos_may_20 = concatenado1[mayor_20]
marca = concatenado1["marca"]=="BMW"

In [81]:
autos_may_20 = concatenado1[autos_may_20 & marca]

In [82]:
autos_may_20

  marca modelo   año  precio  kilometraje       fecha
2   BMW     X5  2021   50000        10000  10-11-2021

In [83]:
filtro = ["Toyota","Ford"]

In [84]:
concatenado1 = concatenado1[concatenado1["marca"].isin(filtro)]

In [85]:
concatenado1

    marca   modelo   año  precio  kilometraje       fecha
0  Toyota  Corolla  2020   20000        15000  15-05-2020
1    Ford  Mustang  2019   30000        20000  20-08-2019

In [64]:
concatenado1["año"] = concatenado1["año"].str.replace(".","")

AttributeError: Can only use .str accessor with string values!

In [63]:
concatenado1.head()

    marca   modelo    año  precio  kilometraje       fecha
0  Toyota  Corolla  2.020   20000        15000  15-05-2020
1    Ford  Mustang  2.019   30000        20000  20-08-2019
2     BMW       X5  2.021   50000        10000  10-11-2021
3    Audi       A4  2.018   35000        25000  25-12-2018
4   Honda    Civic  2.017   18000        18000  05-03-2017

# union de datos

In [33]:
# tipos de uniones CONCAT - MERGE - UNION

In [61]:
# VAMOS CON EL CONCAT